<a href="https://colab.research.google.com/github/maithstartup/Notebooks-Practical-ML-Beginners/blob/master/pandas/statistics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")

In [4]:
df.head(4)

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000

[4 rows x 8 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [6]:
df["Age"].mean()

29.471443066516347

In [9]:
df["Fare"].max()

512.3292

In [10]:
df["Age"].idxmin()

799

In [11]:
df.iloc[799]

Survived                                                1
Pclass                                                  3
Name                       Master. Assad Alexander Thomas
Sex                                                  male
Age                                                  0.42
Siblings/Spouses Aboard                                 0
Parents/Children Aboard                                 1
Fare                                               8.5167
Name: 799, dtype: object

In [12]:
df["Age"].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
882    26057.17
883    26076.17
884    26083.17
885    26109.17
886    26141.17
Name: Age, Length: 887, dtype: float64

In [13]:
df[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [14]:
df[["Age", "Fare"]].describe()

              Age       Fare
count  887.000000  887.00000
mean    29.471443   32.30542
std     14.121908   49.78204
min      0.420000    0.00000
25%     20.250000    7.92500
50%     28.000000   14.45420
75%     38.000000   31.13750
max     80.000000  512.32920

In [15]:
df.describe()

         Survived      Pclass  ...  Parents/Children Aboard       Fare
count  887.000000  887.000000  ...               887.000000  887.00000
mean     0.385569    2.305524  ...                 0.383315   32.30542
std      0.487004    0.836662  ...                 0.807466   49.78204
min      0.000000    1.000000  ...                 0.000000    0.00000
25%      0.000000    2.000000  ...                 0.000000    7.92500
50%      0.000000    3.000000  ...                 0.000000   14.45420
75%      1.000000    3.000000  ...                 0.000000   31.13750
max      1.000000    3.000000  ...                 6.000000  512.32920

[8 rows x 6 columns]

In [16]:
df["Pclass"].value_counts()

3    487
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
df["Survived"].unique()

array([0, 1])

In [19]:
df["Pclass"].nunique()

3

In [20]:
df["Age"].drop_duplicates( )

0      22.00
1      38.00
2      26.00
3      35.00
5      27.00
       ...
751     0.67
763    30.50
799     0.42
839    34.50
847    74.00
Name: Age, Length: 89, dtype: float64

In [21]:
val=df["Fare"].mean()
df["fare_rate"]=df["Fare"].apply(lambda x:x-val)

In [22]:
df

     Survived  Pclass  ...     Fare fare_rate
0           0       3  ...   7.2500 -25.05542
1           1       1  ...  71.2833  38.97788
2           1       3  ...   7.9250 -24.38042
3           1       1  ...  53.1000  20.79458
4           0       3  ...   8.0500 -24.25542
..        ...     ...  ...      ...       ...
882         0       2  ...  13.0000 -19.30542
883         1       1  ...  30.0000  -2.30542
884         0       3  ...  23.4500  -8.85542
885         1       1  ...  30.0000  -2.30542
886         0       3  ...   7.7500 -24.55542

[887 rows x 9 columns]

In [23]:
df.shift(2,fill_value="sample" )

    Survived  Pclass  ...     Fare fare_rate
0     sample  sample  ...   sample    sample
1     sample  sample  ...   sample    sample
2          0       3  ...     7.25  -25.0554
3          1       1  ...  71.2833   38.9779
4          1       3  ...    7.925  -24.3804
..       ...     ...  ...      ...       ...
882        0       3  ...     7.05  -25.2554
883        0       3  ...   29.125  -3.18042
884        0       2  ...       13  -19.3054
885        1       1  ...       30  -2.30542
886        0       3  ...    23.45  -8.85542

[887 rows x 9 columns]

In [24]:
df

     Survived  Pclass  ...     Fare fare_rate
0           0       3  ...   7.2500 -25.05542
1           1       1  ...  71.2833  38.97788
2           1       3  ...   7.9250 -24.38042
3           1       1  ...  53.1000  20.79458
4           0       3  ...   8.0500 -24.25542
..        ...     ...  ...      ...       ...
882         0       2  ...  13.0000 -19.30542
883         1       1  ...  30.0000  -2.30542
884         0       3  ...  23.4500  -8.85542
885         1       1  ...  30.0000  -2.30542
886         0       3  ...   7.7500 -24.55542

[887 rows x 9 columns]

In [25]:
df.shift(-1,fill_value="sample" )

    Survived  Pclass  ...     Fare fare_rate
0          1       1  ...  71.2833   38.9779
1          1       3  ...    7.925  -24.3804
2          1       1  ...     53.1   20.7946
3          0       3  ...     8.05  -24.2554
4          0       3  ...   8.4583  -23.8471
..       ...     ...  ...      ...       ...
882        1       1  ...       30  -2.30542
883        0       3  ...    23.45  -8.85542
884        1       1  ...       30  -2.30542
885        0       3  ...     7.75  -24.5554
886   sample  sample  ...   sample    sample

[887 rows x 9 columns]